In [80]:
import pandas as pd
import numpy as np

In [84]:
df = pd.DataFrame({
    "Name": ["Khabib", "Islam", "Khamzat", "Conor", "DC", "DJ"],
    "Age": [36, 32, 31, 36, 48, 38],
    "Nickname": ["The Eagle", "No Time", "Borz", "The Notorious", "DC", "Mighty Mouse"],
    "Country": ["Russia", "Russia", "Russia", "Ireland", "USA", "USA"]
})

In [85]:
df.iloc[[0]]

     Name  Age   Nickname Country
0  Khabib   36  The Eagle  Russia

In [86]:
df.iloc[1:4]

      Name  Age       Nickname  Country
1    Islam   32        No Time   Russia
2  Khamzat   31           Borz   Russia
3    Conor   36  The Notorious  Ireland

'loc' is Inclusive; 'iloc' is exclusive

In [87]:
df.loc[1:4]

      Name  Age       Nickname  Country
1    Islam   32        No Time   Russia
2  Khamzat   31           Borz   Russia
3    Conor   36  The Notorious  Ireland
4       DC   48             DC      USA

In [88]:
df.iloc[ : :]

      Name  Age       Nickname  Country
0   Khabib   36      The Eagle   Russia
1    Islam   32        No Time   Russia
2  Khamzat   31           Borz   Russia
3    Conor   36  The Notorious  Ireland
4       DC   48             DC      USA
5       DJ   38   Mighty Mouse      USA

In [89]:
df.iloc[ : : 2]

      Name  Age   Nickname Country
0   Khabib   36  The Eagle  Russia
2  Khamzat   31       Borz  Russia
4       DC   48         DC     USA

In [90]:
df.iloc[ : : -1]

      Name  Age       Nickname  Country
5       DJ   38   Mighty Mouse      USA
4       DC   48             DC      USA
3    Conor   36  The Notorious  Ireland
2  Khamzat   31           Borz   Russia
1    Islam   32        No Time   Russia
0   Khabib   36      The Eagle   Russia

In [91]:
df.iloc[ : : -2]

    Name  Age       Nickname  Country
5     DJ   38   Mighty Mouse      USA
3  Conor   36  The Notorious  Ireland
1  Islam   32        No Time   Russia

In [92]:
df.iloc[-2 : ]

  Name  Age      Nickname Country
4   DC   48            DC     USA
5   DJ   38  Mighty Mouse     USA

In [93]:
df.iloc[-5 : -1 : 2]

    Name  Age       Nickname  Country
1  Islam   32        No Time   Russia
3  Conor   36  The Notorious  Ireland

Column slicing: using comma " , " between two

In [94]:
df.iloc[ : , 0]

0     Khabib
1      Islam
2    Khamzat
3      Conor
4         DC
5         DJ
Name: Name, dtype: object

In [95]:
df.iloc[ : , 1]

0    36
1    32
2    31
3    36
4    48
5    38
Name: Age, dtype: int64

In [96]:
df.iloc[ : , 2]

0        The Eagle
1          No Time
2             Borz
3    The Notorious
4               DC
5     Mighty Mouse
Name: Nickname, dtype: object

In [97]:
df.iloc[ :, 0: 3]

      Name  Age       Nickname
0   Khabib   36      The Eagle
1    Islam   32        No Time
2  Khamzat   31           Borz
3    Conor   36  The Notorious
4       DC   48             DC
5       DJ   38   Mighty Mouse

In [99]:
df.iloc[ : , :1]

      Name
0   Khabib
1    Islam
2  Khamzat
3    Conor
4       DC
5       DJ

In [100]:
df.iloc[ : , 2: 5]

        Nickname  Country
0      The Eagle   Russia
1        No Time   Russia
2           Borz   Russia
3  The Notorious  Ireland
4             DC      USA
5   Mighty Mouse      USA

In [101]:
df.iloc[ : :, [0,2]]

      Name       Nickname
0   Khabib      The Eagle
1    Islam        No Time
2  Khamzat           Borz
3    Conor  The Notorious
4       DC             DC
5       DJ   Mighty Mouse

In [115]:
df.iloc[ : :, 4: 1 : -1]

   Country       Nickname
0   Russia      The Eagle
1   Russia        No Time
2   Russia           Borz
3  Ireland  The Notorious
4      USA             DC
5      USA   Mighty Mouse

In [116]:
df

      Name  Age       Nickname  Country
0   Khabib   36      The Eagle   Russia
1    Islam   32        No Time   Russia
2  Khamzat   31           Borz   Russia
3    Conor   36  The Notorious  Ireland
4       DC   48             DC      USA
5       DJ   38   Mighty Mouse      USA

In [124]:
df.iloc[ 2:4 : , 2:4 ]

        Nickname  Country
2           Borz   Russia
3  The Notorious  Ireland

In [127]:
df.iloc[ 0 : 6 : 2 , 0 : 4 : 2 ]

      Name   Nickname
0   Khabib  The Eagle
2  Khamzat       Borz
4       DC         DC